app/controllers/groups_controller.rb

    def create
        @group = Group.new(group_params)
        @user = session[:user_id]

        if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at", "place", "frequency", "additional_detail") VALUES (?, ?, ?, ?, ?, ?)  [["name", "wwbvrwb"], ["created_at", "2019-05-15 20:06:17.759409"], ["updated_at", "2019-05-15 20:06:17.759409"], ["place", "cvewv"], ["frequency", ""], ["additional_detail", ""]]

    def update
        @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @group = Group.find(params[:id])

        Membership.all.each do |membership|
            if membership.group_id == @group.id
                membership.destroy
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]