app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("full_name", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["full_name", "Lucas Civile Nagamine"], ["username", "civile"], ["password", "12345"], ["created_at", "2019-05-15 22:08:21.808979"], ["updated_at", "2019-05-15 22:08:21.808979"]]